Диплом/src/Documents/ПереработкаСырья/ПереработкаСырья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереработкаСырья</name>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериаловИТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ПереработкаЛесаВЩиты</registerRecords>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура_Леса</name>
      <type>
        <types>CatalogRef.РасходникиДляПроизводства_Номенклатура</types>
        <types>CatalogRef.ЛесСырьё_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура_Щитов</name>
      <type>
        <types>CatalogRef.ДеревянныеЩиты_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/Catalogs/ДеревянныеЩиты_Номенклатура/ДеревянныеЩиты_Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДеревянныеЩиты_Номенклатура</name>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>EnumRef.Сорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипДеревянногоЩита</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаВММ</name>
    <comment>Длина в миллиметрпах</comment>
    <type>
      <types>EnumRef.ДлинаЩита</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаВММ</name>
    <comment>Ширина в мм щита</comment>
    <type>
      <types>EnumRef.ШиринаЩита</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолщинаВММ</name>
    <comment>Толщина щита в мм</comment>
    <type>
      <types>EnumRef.ТолщинаЩита</types>
    </type>
  </attributes>
  <attributes>
    <name>МетрКвадратный</name>
    <comment>Метр квадратный</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетрКубический</name>
    <comment>Метр кубический</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицоСпецификации</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлПодпись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.РасходникиДляПроизводства_Номенклатура</types>
        <types>CatalogRef.ЛесСырьё_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойМатериал</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницаИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Диплом/src/Documents/ПереработкаСырья/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьПоСпецификациямНаСервере()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Товары.Номенклатура_Щитов КАК Номенклатура,
	               |	Товары.Количество
	               |ПОМЕСТИТЬ ТЧТовары
	               |ИЗ
	               |	&Товары КАК Товары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДеревянныеЩиты_НоменклатураМатериалы.Номенклатура КАК Номенклатура_Леса,
	               |	СУММА(ДеревянныеЩиты_НоменклатураМатериалы.Количество * ЕСТЬNULL(ТЧТовары.Количество, 0)) КАК Количество
	               |ИЗ
	               |	ТЧТовары КАК ТЧТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДеревянныеЩиты_Номенклатура.Материалы КАК ДеревянныеЩиты_НоменклатураМатериалы
	               |		ПО ТЧТовары.Номенклатура = ДеревянныеЩиты_НоменклатураМатериалы.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДеревянныеЩиты_НоменклатураМатериалы.Номенклатура";               
	Запрос.УстановитьПараметр("Товары",Объект.Товары.Выгрузить());
	Объект.Материалы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСпецификациям(Команда)
	ЗаполнитьПоСпецификациямНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Элементы.ГруппаТовары.Заголовок = "Товары ("+Объект.Товары.Количество()+")";
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Элементы.ГруппаМатериалы.Заголовок = "Материалы ("+Объект.Материалы.Количество()+")";
КонецПроцедуры
